/******************************************************************************\
**  版    权 :  深圳市创客工场科技有限公司(MakeBlock)所有（2030）
**  文件名称 :  mk_json.cpp
**  功能描述 :  数据json格式转换
**  作    者 :  王滨泉
**  日    期 :  2022.06.28
**  版    本 :  V0.0.1
**  变更记录 :  V0.0.1/2022.06.28
                1 首次创建
\******************************************************************************/

#ifndef _MK_JOSN_
#define _MK_JOSN_

//------------------------------------------------------------------------------
/******************************************************************************\
                               Includes
\******************************************************************************/

/******************************************************************************\
                            Macro definitions
\******************************************************************************/

/******************************************************************************\
                            Typedef definitions
\******************************************************************************/
// json数据转换句柄
typedef struct
{
    char *buf;      // 申请转换的数据指针
    short buf_size; // 申请的最大数据长度
    short buf_len;  // 已使用的数据长度
} TS_OBJECT;

// json数据类型
typedef enum
{
    OBJ_TYPE_NONE = 0,
    OBJ_TYPE_INT,       // 有整数
    OBJ_TYPE_UINT,      // 无符号整数
    OBJ_TYPE_FLOAT,     // 浮点数
    OBJ_TYPE_DOUBLE,    // 双精度浮点型
    OBJ_TYPE_INT2STR,   // 整数转换为字符
    OBJ_TYPE_FLOAT2STR, // 浮点数转换为字符
    // OBJ_TYPE_BOOL,          // bool类型
    OBJ_TYPE_NULL,   //
    OBJ_TYPE_STRING, // 字符串类型
} TE_OBJECT_TYPE;
/******************************************************************************\
                            Variables definitions
\******************************************************************************/

/******************************************************************************\
                            Functions definitions
\******************************************************************************/
/* 
* 函数名称 : mk_object_init
* 功能描述 : 字符转换资源初始化
* 参	数 : max_size - 最大长度
* 返回值   : 数据目标句柄
*/
/******************************************************************************/
extern TS_OBJECT *mk_object_init(int max_size);
/******************************************************************************/
/* 
* 函数名称 : mk_object_deinit
* 功能描述 : json字符资源释放
* 参	数 : obj - 数据目标句柄指针
* 返回值   : 无
*/
/******************************************************************************/
extern void mk_object_deinit(TS_OBJECT *obj);
/******************************************************************************/

/* 
* 函数名称 : get_cur_obj_buf
* 功能描述 : 获取当前指针
* 参	数 : obj - 数据目标句柄指针
* 返回值   : 当前指针
*/
/******************************************************************************/
extern char *get_cur_obj_buf(TS_OBJECT *obj);
/******************************************************************************/

/* 
* 函数名称 : add_cur_json_obj_buf
* 功能描述 : 当前使用buf长度累加
* 参	数 : obj - 数据目标句柄指针
             len - buf长度
* 返回值   : 0 - 设置成功
            -1 - 设置出错
*/
/******************************************************************************/
extern int add_cur_obj_buf(TS_OBJECT *obj, int len);
/******************************************************************************/

/* 
* 函数名称 : set_symbol
* 功能描述 : 设置特定符号
* 参	数 : obj - 数据目标句柄指针
             symbol - 符号
* 返回值   : 0 - 设置成功
            -1 - 设置出错
*/
/******************************************************************************/
extern int set_symbol(TS_OBJECT *obj, char symbol);
/******************************************************************************/

/* 
* 函数名称 : set_obj_start
* 功能描述 : 设置起始符号
* 参	数 : obj - 数据目标句柄指针
* 返回值   : 0 - 设置成功
            -1 - 设置出错
*/
/******************************************************************************/
extern int set_obj_start(TS_OBJECT *obj);
/******************************************************************************/

/* 
* 函数名称 : set_obj_end
* 功能描述 : 设置结束符号
* 参	数 : obj - 数据目标句柄指针
* 返回值   : 0 - 设置成功
            -1 - 设置出错
*/
/******************************************************************************/
extern int set_obj_end(TS_OBJECT *obj);
/******************************************************************************/

/* 
* 函数名称 : set_comma
* 功能描述 : 设置逗号
* 参	数 : obj - 数据目标句柄指针
* 返回值   : 0 - 设置成功
            -1 - 设置出错
*/
/******************************************************************************/
extern int set_comma(TS_OBJECT *obj);
/******************************************************************************/

/* 
* 函数名称 : set_tab
* 功能描述 : 设置tab符
* 参	数 : obj - 数据目标句柄指针
* 返回值   : 0 - 设置成功
            -1 - 设置出错
*/
/******************************************************************************/
extern int set_tab(TS_OBJECT *obj);
/******************************************************************************/
/* 
* 函数名称 : set_line_break
* 功能描述 : 设置换行符
* 参	数 : obj - 数据目标句柄指针
* 返回值   : 0 - 设置成功
            -1 - 设置出错
*/
/******************************************************************************/
extern int set_line_break(TS_OBJECT *obj);
/******************************************************************************/
/* 
* 函数名称 : set_quotation_mark
* 功能描述 : 设置双引号
* 参	数 : obj - 数据目标句柄指针
* 返回值   : 0 - 设置成功
            -1 - 设置出错
*/
/******************************************************************************/
extern int set_quotation_mark(TS_OBJECT *obj);
/******************************************************************************/

/* 
* 函数名称 : set_objs
* 功能描述 : 设置json成员字符串
* 参	数 : obj - 数据目标句柄指针
             name - 名称
             value - 数据
             type - 类型
* 返回值   : 0 - 设置成功
            -1 - 设置出错
*/
/******************************************************************************/
extern int set_objs(TS_OBJECT *obj, const char *name, void *value, TE_OBJECT_TYPE type);
/******************************************************************************/

/* 
* 函数名称 : objs_show
* 功能描述 : 数据目标打印
* 参	数 : obj - 数据目标句柄指针
* 返回值   : 无
*/
/******************************************************************************/
extern void objs_show(TS_OBJECT *obj);
/******************************************************************************/
#endif
/******************************* End of File (H) ******************************/