/**************************************************************************\
**  版    权 :  深圳市创客工场科技有限公司(MakeBlock)所有（2030）
**  文件名称 : 
**  功能描述 : 
**  作    者 : 
**  日    期 :  
**  版    本 :  
**  变更记录 :  
\**************************************************************************/

#ifndef MK_FILTER_H
#define MK_FILTER_H

#ifdef __cplusplus
extern "C" {
#endif
/**************************************************************************\
                               Includes
\**************************************************************************/
#include "stdint.h"
/**************************************************************************\
                            Macro definitions
\**************************************************************************/

/**************************************************************************\
                            Typedef definitions
\**************************************************************************/
//卡尔曼滤波参数结构体
typedef struct
{
    double resData; //源数据
    double Q_Value; //过程噪声
    double R_Value; //测量噪声
    double I_Value; //初值

    //以下两个变量不需要赋值，只供函数调用
    double x_last; //前一次的估出最优值
    double p_last; //前一次最优值对应的covariance
} TS_Kalman_Param;
/**************************************************************************\
                         Global variables definitions
\**************************************************************************/

/**************************************************************************\
                         Global functions definitions
\**************************************************************************/

/**
* \brief 中值滤波
* \param[in] Array：需要排序的数组 / ArraySize:数组成员个数
* \return 滤波值
*/
uint16_t mk_filter_average(uint16_t *Array, uint16_t ArraySize);

/**
* \brief 选择排序算法的滤波函数
* \param[in] Array：需要排序的数组 / ArraySize:数组成员个数, 需大于4
* \return NONE
*/
uint32_t mk_filter_selectionSort(int *Array, uint8_t ArraySize);

/**
* \brief 卡尔曼滤波
* \param[in] 卡尔曼滤波参数结构体指针 TS_Kalman_Param*
* \return 滤波后的值
*/
double mk_filter_kalman(TS_Kalman_Param *pParam);

#ifdef __cplusplus
}
#endif

#endif
/**************************** End of File (H) ****************************/
