
/****************************************************************************\
**  版    权 :  
**  文件名称 :  
**  功能描述 :  
**  作    者 :  
**  日    期 :  
**  版    本 :  V0.0.1
**  变更记录 :  V0.0.1/
                1 首次创建
\****************************************************************************/

/****************************************************************************\
                               Includes
\****************************************************************************/
#ifndef __DRV_TIMER_H
#define __DRV_TIMER_H

#include <stdint.h>
#include "stm32f4xx.h"
/****************************************************************************\
                            Macro definitions
\****************************************************************************/

/****************************************************************************\
                            Typedef definitions
\****************************************************************************/
// 串口ID枚举
typedef enum
{
    DRV_TIMER_ID_1 = 0,      // TIM1
    DRV_TIMER_ID_2,          // TIM2
    DRV_TIMER_ID_3,          // TIM3
    DRV_TIMER_ID_4,          // TIM4
    DRV_TIMER_ID_5,          // TIM5
    DRV_TIMER_ID_6,          // TIM6
    DRV_TIMER_ID_7,          // TIM7
    DRV_TIMER_ID_8,          // TIM8
    DRV_TIMER_ID_9,          // TIM9
    DRV_TIMER_ID_10,          // TIM10
    DRV_TIMER_ID_11,          // TIM11
    DRV_TIMER_ID_MAX
}TE_DRV_TIMER_ID;

typedef struct
{
    TE_DRV_TIMER_ID id;        // 定时器ID
    uint16_t        prescaler; // 分频
    uint32_t        Period;    // 计数值
} TS_TIMER_HANDLE;

// 定时器中断回调函数类型定义
typedef void (*DRV_TIMER_CALLBACK)(void);
/****************************************************************************\
                            Variables definitions
\****************************************************************************/

/****************************************************************************\
                            Functions definitions
\****************************************************************************/
void drv_timer_init(TS_TIMER_HANDLE *p_this, DRV_TIMER_CALLBACK irq_callback);
 
#endif
