/****************************************************************************\
**  文件名称 :  driver.c
**  功能描述 :  Bootloader 驱动总入口。初始化 Flash、输出、串口、指示灯等，供升级与跳转使用。
**  作    者 :  -
**  日    期 :  -
**  版    本 :  V0.0.1
\****************************************************************************/

/******************************************************************************\
                                 Includes
\******************************************************************************/
#include <stdio.h>
#include "system.h"
#include "driver.h"
#include "drv_comm.h"
#include "drv_flash.h"
#include "drv_output.h"
#include "plugin_led.h"
#include "thread.h"
/******************************************************************************\
                             Macro definitions
\******************************************************************************/

/******************************************************************************\
                             Typedef definitions
\******************************************************************************/

/******************************************************************************\
                             Variables definitions
\******************************************************************************/

/******************************************************************************\
                             Functions definitions
\******************************************************************************/
static char driver_task (thread_t* pt);

/**
 * \brief 驱动初始化
 */
void driver_init(void)
{    
    drv_flash_init();
	drv_output_init();
    drv_usart_init(DRV_USART_ID_1, 115200, NULL);
	drv_usart_init(DRV_USART_ID_2, 115200, NULL);
    drv_usart_set_printf_port(DRV_USART_ID_1);
	plugin_led_init();
	
    
    // thread_create(driver_task);
}



/**
 * \brief 任务
 */
static char driver_task(thread_t* pt)
{
    thread_begin
    {
		
        while (1)
        {
            printf("driver_task\r\n");
            thread_sleep(1000);
        }
    }
    thread_end
}


